---
kind: method
id: M:Autodesk.Revit.DB.Transform1D.Dispose
source: html/a231ae0e-ce21-1433-b42a-d4c96f23d9c6.htm
---
# Autodesk.Revit.DB.Transform1D.Dispose Method

Releases all resources used by the Transform1D

## Syntax (C#)
```csharp
public void Dispose()
```